In [99]:
import pandas as pd

train = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")

train.shape, test.shape
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29304 entries, 0 to 29303
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              29304 non-null  int64
 1   age             29292 non-null  float64
 2   workclass       27642 non-null  object
 3   fnlwgt          29304 non-null  int64
 4   education       29304 non-null  object
 5   education.num   29304 non-null  int64
 6   marital.status  29304 non-null  object
 7   occupation      27636 non-null  object
 8   relationship    29304 non-null  object
 9   race            29304 non-null  object
 10  sex             29304 non-null  object
 11  capital.gain    29304 non-null  int64
 12  capital.loss    29304 non-null  int64
 13  hours.per.week  29291 non-null  float64
 14  native.country  28767 non-null  object
 15  income          29304 non-null  object
dtypes: float64(2), int64(5), object(9)
memory usage: 3.6+ MB

In [9]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3257 entries, 0 to 3256
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              3257 non-null   int64
 1   age             3251 non-null   float64
 2   workclass       3083 non-null   object
 3   fnlwgt          3257 non-null   int64
 4   education       3257 non-null   object
 5   education.num   3257 non-null   int64
 6   marital.status  3257 non-null   object
 7   occupation      3082 non-null   object
 8   relationship    3257 non-null   object
 9   race            3257 non-null   object
 10  sex             3257 non-null   object
 11  capital.gain    3257 non-null   int64
 12  capital.loss    3257 non-null   int64
 13  hours.per.week  3248 non-null   float64
 14  native.country  3211 non-null   object
dtypes: float64(2), int64(5), object(8)
memory usage: 381.8+ KB

In [19]:
train.describe()
train.describe(include='object')
test.describe(include='object')

,workclass,education,marital.status,occupation,relationship,race,sex,native.country
count,3083,3257,3257,3082,3257,3257,3257,3211
unique,8,16,7,14,6,5,2,37
top,Private,HS-grad,Married-civ-spouse,Prof-specialty,Husband,White,Male,United-States
freq,2245,1052,1510,457,1348,2794,2212,2930

In [23]:
train.isnull().sum()
test.isnull().sum()

id                  0
age                 6
workclass         174
fnlwgt              0
education           0
education.num       0
marital.status      0
occupation        175
relationship        0
race                0
sex                 0
capital.gain        0
capital.loss        0
hours.per.week      9
native.country     46
dtype: int64

In [101]:
print("처리전:", train.shape)
# train = train.dropna(subset=['native.country', 'workclass'])
print("처리후:", train.shape)
train.isnull().sum()

처리전: (29304, 16)
처리후: (29304, 16)

id                   0
age                 12
workclass         1662
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1668
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week      13
native.country     537
income               0
dtype: int64

In [103]:
# train 데이터
mode1 = train['workclass'].mode()[0]
print(mode1)
train['workclass'] = train['workclass'].fillna(mode1)
mode1 = train['native.country'].mode()[0]
print(mode1)
train['native.country'] = train['native.country'].fillna(mode1)

train['occupation'] = train['occupation'].fillna('X')
train.isnull().sum()

Private
United-States

id                 0
age               12
workclass          0
fnlwgt             0
education          0
education.num      0
marital.status     0
occupation         0
relationship       0
race               0
sex                0
capital.gain       0
capital.loss       0
hours.per.week    13
native.country     0
income             0
dtype: int64

In [105]:
# test 데이터
mode1 = test['workclass'].mode()[0]
print(mode1)
test['workclass'] = test['workclass'].fillna(mode1)
mode1 = train['native.country'].mode()[0]
print(mode1)
test['native.country'] = test['native.country'].fillna(mode1)

test['occupation'] = test['occupation'].fillna('X')
test.isnull().sum()

Private
United-States

id                0
age               6
workclass         0
fnlwgt            0
education         0
education.num     0
marital.status    0
occupation        0
relationship      0
race              0
sex               0
capital.gain      0
capital.loss      0
hours.per.week    9
native.country    0
dtype: int64

In [59]:
train.describe()

,id,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
count,29304.000000,29292.000000,2.930400e+04,29304.000000,29304.000000,29304.000000,29291.000000
mean,16264.027880,38.553223,1.897488e+05,10.080842,1093.858722,86.744506,40.434229
std,9384.518323,13.628811,1.055250e+05,2.570824,7477.435640,401.518928,12.324036
min,0.000000,-38.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,8145.750000,28.000000,1.177890e+05,9.000000,0.000000,0.000000,40.000000
50%,16253.500000,37.000000,1.783765e+05,10.000000,0.000000,0.000000,40.000000
75%,24374.250000,48.000000,2.370682e+05,12.000000,0.000000,0.000000,45.000000
max,32560.000000,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [107]:
train['age'].head(20)
train[train['age'] <= 0]

print(train.shape)
train = train[train['age'] > 0]
print(train.shape)

(29304, 16)
(29289, 16)

In [109]:
# y_train = train.pop("income")

print(train.shape, test.shape)
train_oh = pd.get_dummies(train)
test_oh = pd.get_dummies(test)
print(train.shape, test.shape, train_oh.shape, test_oh.shape)

(29289, 16) (3257, 15)
(29289, 16) (3257, 15) (29289, 109) (3257, 103)

In [115]:
train.describe(include="object")

,workclass,education,marital.status,occupation,relationship,race,sex,native.country,income
count,29289,29289,29289,29289,29289,29289,29289,29289,29289
unique,8,16,7,15,6,5,2,41,2
top,Private,HS-grad,Married-civ-spouse,Prof-specialty,Husband,White,Male,United-States,<=50K
freq,22100,9444,13457,3682,11837,25008,19563,26763,22254

In [125]:
from sklearn.preprocessing import LabelEncoder
# cols = train.select_types(include="object").columns
# cols = train.columns[train.types == object]
# cols

y_train = train.pop("income")

cols = ["workclass", "education", "marital.status", "occupation", "relationship", "race", "sex", "native.country"]
cols

for col in cols:
    le = LabelEncoder()
    train[col] = le.fit_transform(train[col])
    test[col] = le.fit_transform(test[col])
train.head()

,id,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country
0,3331,34.0,6,177331,15,10,2,9,0,2,1,4386,0,40.0,38
1,19749,58.0,3,290661,11,9,2,2,0,4,1,0,0,40.0,38
2,1157,48.0,3,125933,15,10,6,3,4,2,0,0,1669,38.0,38
3,693,58.0,3,100313,15,10,2,10,0,4,1,0,1902,40.0,38
4,12522,41.0,3,195661,15,10,2,13,0,4,1,0,0,54.0,38

In [127]:
from sklearn.model_selection import train_test_split

X_train, X_val, y_train, y_val = train_test_split(train, y_train, test_size=0.2, random_state=1)
X_train.shape, X_val.shape, y_train.shape, y_val.shape

((23431, 15), (5858, 15), (23431,), (5858,))

In [177]:
from sklearn.ensemble import RandomForestClassifier

rf = RandomForestClassifier()
rf.fit(X_train, y_train)
pred = rf.predict_proba(X_val)

print(rf.classes_)
pred[:10]

['<=50K' '>50K']

array([[1.  , 0.  ],
       [0.74, 0.26],
       [0.76, 0.24],
       [0.67, 0.33],
       [0.89, 0.11],
       [0.37, 0.63],
       [0.99, 0.01],
       [1.  , 0.  ],
       [0.33, 0.67],
       [1.  , 0.  ]])

In [178]:
from sklearn.metrics import roc_auc_score, accuracy_score, f1_score
# roc_auc
roc_auc = roc_auc_score(y_val, pred[:,1])
print("roc_auc:", roc_auc)

# accuracy
# pred = rf.predict(X_val)
# pred[:10]
# accuracy = accuracy_score(y_val, pred)
# print("accuracy:", accuracy)

# fl_score
# f1 = f1_score(y_val, pred, pos_label='>50K')
# print("f1_score:", f1)

pred2 = rf.predict_proba(test)
pred2

roc_auc: 0.915449948742995

array([[0.96, 0.04],
       [0.97, 0.03],
       [0.96, 0.04],
       ...,
       [0.91, 0.09],
       [0.98, 0.02],
       [0.91, 0.09]])

In [189]:
submit = pd.DataFrame({'pred': pred2[:,1]})
submit.to_csv("result.csv", index=False)

pd.read_csv("result.csv")

      pred
0     0.04
1     0.03
2     0.04
3     0.76
4     0.04
...    ...
3252  0.08
3253  0.32
3254  0.09
3255  0.02
3256  0.09

[3257 rows x 1 columns]